GREETING_TEXT: str = (
    r"""
Привет\! Я — Пит, твой карманный помощник в изучении Python\.

⭐ 500\+ задач разного уровня сложности

⭐ Новые вопросы каждый день\!

⭐ Получай достижения\!

⭐ Займи свое место в таблице лидеров\!
    """
)

START_BUTTON_TEXT: str = (
    'Играть в 1 клик! 🚀'
)

CHANGE_LEVEL_BUTTON_TEXT: str = (
    'Изменить уровень 🎓'
)

SOLVE_QUESTIONS_BUTTON_TEXT: str = (
    'Изучать python! 🐍'
)

CORRECT_ANSWERS: list = [
    r"Ура, это правильный ответ\! 🎉",
    r"Точно в яблочко\! 🎯",
    r"Абсолютно верно\! 🌟",
    r"Верно\! Ты просто космос\! 🚀",
    r"Правильный ответ\! 👍",
    r"Так точно\! Ты справился на ура\! 🏆",
    r"И это правильный ответ\! ✅",
    r"Верно\! У тебя отлично получается\! 😉",
    r"Да, это правильный ответ\! 👌",
    r"Браво\! Совершенно верно\! 🤝"
]

INCORRECT_ANSWERS: list[str] = [
    r"Ой\-ой, кажется, это не тот ответ 😯",
    r"Упс, мимо\! 🙊",
    "Ошибочка вышла 🙈",
    r"Не угадал\! 🙅‍♂️",
    "К сожалению, это не так 🚫",
    "Не тот ответ, друг 🕵️‍♂️"
]

PREPAYMENT_TEXT: str = (
    r"""
*Твой бесплатный период закончился\! 😢*

Всего за 799 рублей ты получишь:
⭐ 500\+ задач разного уровня сложности
⭐ Новые вопросы и достижения\!
⭐ Подборки по слабым темам\!

*Я стараюсь развивать проект: добавляю новые фишки и вопросы\! Твоя поддержка мне очень поможет\!*
    """
)


THANK_YOU_FOR_PAYMENT_CAN_FIND_QUESTION_TEXT: str = (
    r"""
Спасибо за оплату\! Отправляемся в путешествие 💫

Если у тебя возникли какие\-либо проблемы с ботом — [пиши](http://t.me/MarksAngeles)\. Я постараюсь помочь тебе\!
    """
)

THANK_YOU_FOR_PAYMENT_CAN_NOT_FIND_QUESTION_TEXT: str = (
    r"""
Спасибо за оплату\! Завтра я подготовлю для тебя новые вопросы\! 😉

Если у тебя возникли какие\-либо проблемы с ботом — [пиши](http://t.me/MarksAngeles)\. Я постараюсь помочь тебе\!
    """
)


NEW_QUESTION_FOR_YOU_TEXTS: list[str] = [
    r"""
Готов проверить свои навыки? Вот и новые вопросы на сегодня\! ⬇️
    """,
    r"""
Время прокачать свои умения\! Тебя ждут свежие задачки\! ⬇️
    """,
    r"""
Новые вызовы уже здесь\! Попробуй свои силы\! ⬇️
    """,
    r"""
Каждый день — новые вопросы\! Готов справиться\? ⬇️
    """,
    r"""
Сегодня тебя ждут интересные задачи\! Проверь свои знания\. ⬇️
    """,
    r"""
Готов учиться дальше\? Новые вопросы уже ждут\! ⬇️
    """,
    r"""
Не упусти возможность улучшить свои навыки\! Вот сегодняшние вопросы\. ⬇️
    """,
    r"""
Новые вызовы на сегодня\! Давай посмотрим, как ты справишься\. ⬇️
    """
]

NO_MORE_QUESTIONS_TEXT: str = (
    """
Вопросы закончились 🥲
Переключи уровень командой /level, там еще куча вопросов 🚀
Или посмотри все вопросы еще раз и подтяните свои слабые темы 😉
    """
)
