GREETING_TEXT: str = (
    'Я – Пит.\n\n'
    'И я помогу тебе изучить Python в разы эффективнее и держать рабочий ритм.\n\n'
    'Каждый день тебя ждут задачки, решение которых занимает всего пару минут!\n\n'
    '✅<u>Всего за 30 дней ты:</u>\n'
    '🐍 начнешь разбираться в Python\n'
    '💪 сможешь с легкостью решить базовые задачи\n'
    '🦥 выработаешь привычку учить язык\n'
    '🥇 И станешь классным программистом, ведь все зависит от твоего выбора!\n\n'
    'А я помогу тебе с этим при помощи интересных вопросов и задач.\n\n'
    'Некоторые из них ждут тебя уже сегодня ⚡️'
)

START_BUTTON_TEXT: str = (
    'Поехали 🚀'
)

CORRECT_ANSWER_TEXT: str = (
    'Правильно ✅\n\n'
)

INCORRECT_ANSWER_TEXT: str = (
    'Неправильно ❌\n\n'
)

ENOUGH_QUESTIONS_FOR_TODAY_TEXTS: list[str] = [
    """
Сегодня – всё!

Жди новых заданий на пути к изучению Python уже завтра⚡️

Ты можешь дальше-больше!
Камон, эврибади пучехензап 💥
    """,
    """
«Для средульки хватит!»

Новые задачки уже завтра⚡️
    """,
    """
На сегодня всё!

Задачи ждут тебя завтра, а пока отдыхай и набирайся сил 🔋
    """,
    """
Белиссимо 🤌

Завтра жди новые крутые задачи!
    """,
    """
Ты молодец🌟

Завтра встречаемся как обычно!
    """,
    """
Cегодня все!

С нетерпением жду тебя завтра👋
    """,
    """
На сегодня все, отдыхай!

А я уже готовлю для тебя новые задачи на завтра 🤩
    """
]

PREPAYMENT_TEXT: str = (
    """
<b>Твой бесплатный период закончился 💫 </b>

Мы готовы готовить тебя к собеседованию и выделить тебя из тысяч других кандидатов на вакансии!

- подготовили более 1000 вопросов с нюансами Python
- разбор более 100 типовых задачек, которые просят закодить на собеседовании
- статьи с разбором инженерных вопросов про сети и операционные системы

Оплати следующие 30 дней тренажера. Для тебя это будет стоить 799 рублей
    """
)

# TODO: rewrite text
THANK_YOU_FOR_PAYMENT_TEXT: str = (
    """
Спасибо больше за оплату!
    """
)

