GREETING_TEXT: str = (
    """
Привет! Я — Пит.  Твой карманный помощник для подготовки к собеседованию на Python разработчика!

🤑 Как ты знаешь, на позицию Junior Python разработчика сейчас приходится до 1000 кандидатов, которые также прошли
курсы и хотят получить работу

✅ Бот каждый день будет готовить тебя к решению задач на собеседованиях: будет отправлять вопросы про нюансы и
хитрости языка Python, статьи с разбором задач и вопросов с собеседований. В день это потребует всего 5 - 10 минут!

🏁 Эти знания позволят тебе быть на шаг впереди на собеседовании: решать задачи, отвечать на хитрые вопросы,
чувствовать себя максимально уверенно за счет своих крепких знаний
    """
)

START_BUTTON_TEXT: str = (
    'Поехали 🚀'
)

CORRECT_ANSWERS: list = [
    "Ура, это правильный ответ! 🎉",
    "Точно в яблочко! 🎯",
    "Абсолютно верно! 🌟",
    "Верно! Ты просто космос! 🚀",
    "Правильный ответ! 👍",
    "Так точно! Ты справился на ура! 🏆",
    "И это правильный ответ! ✅",
    "Верно! У тебя отлично получается! 😉",
    "Да, это правильный ответ! 👌",
    "Браво! Совершенно верно! 🤝"
]

INCORRECT_ANSWERS = [
    "Ой-ой, кажется, это не тот ответ 😯.",
    "Упс, мимо! 🙊",
    "Ошибочка вышла 🙈",
    "Не угадал! 🙅‍♂️",
    "В этот раз не тот выбор 🙉",
    "К сожалению, это не так 🚫",
    "Не тот ответ, друг 🕵️‍♂️"
]

ENOUGH_QUESTIONS_FOR_TODAY_TEXTS: list[str] = [
    """
Сегодня – всё!

Жди новых заданий на пути к изучению Python уже завтра⚡️

Ты можешь дальше-больше!
Камон, эврибади пучехензап 💥
    """,
    """
«Для средульки хватит!»

Новые задачки уже завтра⚡️
    """,
    """
На сегодня всё!

Задачи ждут тебя завтра, а пока отдыхай и набирайся сил 🔋
    """,
    """
Белиссимо 🤌

Завтра жди новые крутые задачи!
    """,
    """
Ты молодец🌟

Завтра встречаемся как обычно!
    """,
    """
Cегодня все!

С нетерпением жду тебя завтра👋
    """,
    """
На сегодня все, отдыхай!

А я уже готовлю для тебя новые задачи на завтра 🤩
    """
]

<<<<<<< HEAD
PREPAYMENT_TEXT: str = (
    """
<b>Твой бесплатный период закончился 🙄</b>

Мы готовы выделить тебя из тысяч других кандидатов!

– подготовили более 1000 вопросов с нюансами Python
– разбор более 100 типовых задачек, которые просят закодить на собеседовании
– статьи с разбором инженерных вопросов про сети и операционные системы

<b>Оплати следующие 30 дней тренажера.</b> Для тебя это будет стоить 799 рублей!

А еще, вступай в наш канал https://t.me/code_for_beginners!

В него мы будем писать новости из мира Python, интересные статьи и мемы. Но самое полезное и авторское
будет только тут 😎
    """
)

# TODO: rewrite text
THANK_YOU_FOR_PAYMENT_TEXT: str = (
    """
Спасибо за оплату! Отправляемся в путешествие 💫

Если у тебя возникли какие-либо проблемы с ботом — пиши http://t.me/pillowsman. Ответим тебе и решим проблему в
течении пары часов!
    """
)


=======
>>>>>>> master
CHOOSE_LEVEL_TEXT: str = (
    """
Мне уже не терпится отправить тебе задачи!
Но для начала я хотел бы узнать твой уровень знаний, чтобы мы работали эффективно🔋

👶 - я новичок, прошел переменные, циклы и условия в Python
👨‍🎓 - я уже знаю python, уже знаю классы, лямбда функции, коллекции

Ты всегда сможешь изменить свой уровень командами:
/difficult - сделать посложнее
/easy - сделать полегче
    """
)

FINISH_ONBOARDING_TEXT: str = (
    """
Отлично!
С этого момента бот будет отправлять тебе вопросы, качай свои навыки в python! Соревнуйся с другими участниками!

А еще, вступай в мой канал https://t.me/python_dev_mentor! Там я разбираю разные интересные темы,
 помогаю готовиться к собеседованиям, да и просто со мной можно пообщаться 🙂!
    """
)

NO_MORE_QUESTIONS_TEXT: str = (
    """
Вопросы закончились 🥲
Если вы решали простые вопросы, то можете переключить уровень на сложный, командой /difficult
Или посмотрите все вопросы еще раз и подтяните свои слабые темы 😉
    """
)
