GREETING_TEXT: str = (
    'Привет! Я — это ты из будущего. Ты смог выучить Python и построил крутую карьеру.\n\n'

    'Выучить язык программирования — не просто. Для этого требуется много мотивации и желания разбираться.'
    ' А мы по природе не всегда можем долго концентрироваться на сложных задачах.\n\n'

    'В этом ботике я помогу тебе держать постоянное желание учить Python.'
    ' Буду задавать тебе вопросы, которые ты сможешь решить, если потратишь пару минут в день.\n\n'

    'За 30 дней <b>ты наберешь достаточно мотивации и выработаешь привычку</b>'
    ' для того, чтобы продолжить разбираться в языке.'
    ' В интернете полно уроков и разных школ, которые помогут тебе обучиться Python.\n\n'

    'Я лишь помогу тебе выработать привычку через интересные вопросы и задачки.'
)

ONBOARDING_START_TEXT: str = (
    'Я тебя поспрашиваю пару вопросов. Хочу понять, что ты уже успел изучить в Python.\n'

    'Там будет буквально парочку вопросов и несколько вариантов ответов для каждого.\n'

    'Лучше отвечать честно и не пробовать угадать, если ты не знаешь.'
    ' Так я смогу подобрать задачки для твоего уровня, чтобы тебе было интересно.'
)

ONBOARDING_START_BUTTON_TEXT: str = (
    'Готов к вопросам 🚀'
)

ONBOARDING_FINISH_TEXT: str = (
    'Мы определили твой уровень и готовы начинать 🚀!\n\n'

    'Впереди тебя ждут:\n'

    '🤔3 вопроса каждый день\n'

    '📖По каждому вопросу расскажем правильный ответ и дадим немного теории, чтобы закрепить знания\n'

    '🗓30 дней для формирования привычки'
)

CORRECT_ANSWER_TEXT: str = (
    'Правильно! 👍\n\n'
)

INCORRECT_ANSWER_TEXT: str = (
    'Неправильно 🤪 Но сейчас расскажу тебе, как надо было отвечать.\n\n'
)

ENOUGH_QUESTIONS_FOR_TODAY: str = (
    'Это все на сегодня, чемпион! 😎\n\n'

    'Твой мозг уже сделал один шаг в сторону привычки.'
    ' Дай себе немного времени и нужные связи в твоей голове скоро установятся.'
    ' Ты обретешь интерес и мотивацию — так тебе будет очень просто освоить язык дальше и получить работу мечты ❤️'
)
