GREETING_TEXT: str = (
    'Привет 🖖!\n\n'
    'Я - Пит, и я помогу тебе изучать Python в разы эффективнее и держать рабочий ритм.\n\n'
    'Каждый день тебя ждут задачки, решение которых занимает всего пару минут!\n\n'
    '<u>Всего за 30 дней ты:</u>\n'
    '🐍 начнешь разбираться в Python\n'
    '💪 сможешь с легкостью решить базовые задачи\n'
    '🦥 выработаешь привычку учить язык\n'
    '🥇 И станешь классным программистом, ведь все зависит от твоего выбора!\n\n'
    'И станешь классным программистом, ведь все зависит от твоего выбора!\n\n'
    'А я помогу тебе развиваться на этом пути с помощью интересных вопросов и задач.\n\n'
    'Некоторые из них ждут тебя уже сегодня ⚡️'
)

START_BUTTON_TEXT: str = (
    'Поехали 🚀'
)

CORRECT_ANSWER_TEXT: str = (
    'Правильно ✅\n\n'
)

INCORRECT_ANSWER_TEXT: str = (
    'Неправильно ❌\n\n'
)

ENOUGH_QUESTIONS_FOR_TODAY: str = (
    '«Бесконечность — не предел!» 🚀\n'
    'Но на сегодня — всё.\n\n'
    'Ты сделал большой шаг на пути к карьере успешного программиста!\n'
    'Так держать 🔥\n\n'
    'Ты можешь дальше-больше!\n'
    'Камон, эврибади пучехензап 💥'
)
